{"helptext": ["ce-covariance metric", "         across the levels of factor A can be specified through pdCompSymm(~0+A)", "         The list of random terms should be separated by space within (single or", "         double) quotes.", "         Notice: In the case of computing ICC values, list all the factors with", "         which the ICC is to be obtained. For example, with two factors \"Scanner\"", "         and \"Subj\", set it as -ranEff \"Scanner+Subj\". See Example 4 in the", "         the help.", "", "   -resid PREFIX: Output file name for the residuals. For AFNI format, provide", "         prefix only without view+suffix. Filename for NIfTI format should", "         have .nii attached, while file name for surface data is expected", "         to end with .niml.dset. The sub-brick labeled with the '(Intercept)',", "         if present, should be interpreted as the effect with each factor", "         at the reference level (alphabetically the lowest level) for each", "         factor and with each quantitative covariate at the center value.", "", "   -show_allowed_options: list of allowed options", "", "   -vVarCenters VALUES: Specify centering values for voxel-wise covariates", "         identified under -vVars. Multiple centers are separated by ", "         commas (,) within (single or double) quotes. The order of the", "         values should match that of the quantitative variables in -qVars.", "         Default (absence of option -vVarsCetners) means centering on the", "         average of the variable across ALL subjects regardless their", "         grouping. If within-group centering is desirable, center the", "         variable YOURSELF first before the files are fed into -dataTable.", "", "   -vVars variable_list: Identify voxel-wise covariates with this option.", "         Currently one voxel-wise covariate is allowed only, but this", "         may change if demand occurs...", "         By default mean centering is performed voxel-wise across all", "         subjects. Alternatively centering can be specified through a", "         global value under -vVarsCenters. If the voxel-wise covariates", "         have already been centered, set the centers at 0 with -vVarsCenters."], "params": [{"param_range": [1000, 1021], "help_range": [1023, 1046]}, {"param_range": [1051, 1063], "help_range": [1072, 1626]}, {"param_range": [1631, 1637], "help_range": [1653, 2101]}], "previous": "3dLME_part3.json"}