{"helptext": ["ding", "         'Condition : 1*A -1*B & 1*A -1*C Emotion : 1*pos -1*neg' shows", "         the interaction between the three levels of Condition and the two.", "         levels of Emotion.", "", "         NOTE:", "", "         1) The weights for a variable do not have to add up to 0.", "", "         2) When a quantitative variable is present, other effects are", "         tested at the center value of the covariate unless the covariate", "         value is specified as, for example, 'Group : 1*Old Age : 2', where", "         the Old Group is tested at the Age of 2 above the center.", "", "         3)  The absence of a categorical variable in a coding means the", "         levels of that factor are averaged (or collapsed) for the GLF.", "", "         4) The appearance of a categorical variable has to be followed", "         by the linear combination of its levels.", "", "   -glfLabel k label: Specify the label for the k-th general linear F-test", "         (GLF). A symbolic coding for the GLF is assumed to follow with", "         each -glfLabel.", "", "   -gltCode k CODING: Specify the k-th general linear test (GLT) through a", "         weighted combination among factor levels. The symbolic coding has", "         to be within (single or double) quotes. For example, the following", "         'Condition : 2*House -3*Face Emotion : 1*positive '", "         requests for a test of comparing 2 times House condition", "         with 3 times Face condition while Emotion is held at positive", "         valence.", "", "         NOTE:", "", "         1) The weights for a variable do not have to add up to 0.", "", "         2) When a quantitative variable is present, other effects are", "         tested at the center value of the covariate unless the covariate", "         value is specified as, for example, 'Group : 1*Old Age : 2', where", "         the Old Group is tested at the Age of 2 above the center.", "", "         3) The effect for a quantitative variable can be specified with,", "         for example, 'Group : 1*Old Age : ', or ", "         'Group : 1*Old - 1*Young Age : '", "", "         4) The absence of a categorical variable in a coding means the", "         levels of that factor are averaged (or collapsed) for the GLT.", "", "         5) The appearance of a categorial variable has to be followed", "         by the linear combination of its levels. Only a quantitative", "         is allowed to have a dangling coding as seen in 'Age :'", "", "   -gltLabel k label: Specify the label for the k-th general linear test", "         (GLT). A symbolic coding for the GLT is assumed to follow with", "         each -gltLabel.", "", "   -help: this help message", "", "   -jobs NJOBS: On a multi-processor machine, parallel computing will speed ", "         up the program significantly.", "         Choose 1 for a single-processor computer.", "", "   -logLik: Add this option if the voxel-wise log likelihood is wanted in the output.", "         This option currently cannot be combined with -ICC, -ICCb, -LOGIT.", "", "   -mask MASK: Process voxels inside this mask only.", "          Default is no masking.", "", "   -model FORMULA: Specify the terms of fixed effects for all explanatory,", "         including quantitative, variables. The expression FORMULA with more", "         than one variable has to be surrounded within (single or double)", "         quotes. Variable names in the formula should be consistent with", "         the ones used in the header of -dataTable. A+B represents the", "         additive effects of A and B, A:B is the interaction between A", "         and B, and A*B = A+B+A:B. Subject should not occur in the model", "         specification here.", "", "   -num_glf NUMBER: Specify the number of general linear F-tests (GLFs). A glf", "         involves the union of two or more simple tests. See details in ", "         -glfCode.", "", "   -num_glt NUMBER: Specify the number of general linear t-tests (GLTs). A glt", "         is a linear combination of a factor levels. See details in ", "         -gltCode.", "", "   -prefix PREFIX: Output file name. For AFNI format, provide prefix only,", "         with no view+suffix needed. Filename for NIfTI format should have", "         .nii attached, while file name for surface data is expected", "         to end with .niml.dset. The sub-brick labeled with the '(Intercept)',", "         if present, should be interpreted as the effect with each factor", "         at the reference level (alphabetically the lowest level) for each", "         factor and with each quantitative covariate at the center value.", "", "   -qVarCenters VALUES: Specify centering values for quantitative variables", "         identified under -qVars. Multiple centers are separated by ", "         commas (,) without any other characters such as spaces and should", "         be surrounded within (single or double) quotes. The order of the", "         values should match that of the quantitative variables in -qVars.", "         Default (absence of option -qVarsCetners) means centering on the", "         average of the variable across ALL subjects regardless their", "         grouping. If within-group centering is desirable, center the", "         variable YOURSELF first before the values are fed into -dataTable.", "", "   -qVars variable_list: Identify quantitative variables (or covariates) with", "         this option. The list with more than one variable has to be", "         separated with comma (,) without any other characters such as", "         spaces and should be surrounded within (single or double) quotes.", "          For example, -qVars \"Age,IQ\"", "         WARNINGS:", "         1) Centering a quantitative variable through -qVarsCenters is", "         very critical when other fixed effects are of interest.", "         2) Between-subjects covariates are generally acceptable.", "         However EXTREME caution should be taken when the groups", "         differ significantly in the average value of the covariate.", "         3) Within-subject covariates are better modeled with 3dLME.", "", "   -ranEff FORMULA: Specify the random effects. The simplest and most common", "         one is random intercept, \"~1\", meaning each subject deviates some", "         amount (called random effect) from the group average. \"~RT\" or \"~1+RT\"", "         means that each subject has a unique intercept as well as a slope,", "         and the correlation between the two random effects are estimated, not", "         assumed, from the data. \"~0+RT\" indicates that only a random effect", "         of slope is desired. Compound symmetry for a variance-covariance metric", "         across the levels of factor A can be specified through pdCompSymm(~0+A)", "         The list of random terms should be separated by space within (single or", "         double) quotes.", "         Notice: In the case of computing ICC values, list all the factors with", "         which the ICC is to be obtained. For example, with two factors \"Scanner\"", "         and \"Subj\", set it as -ranEff \"Scanner+Subj\". See Example 4 in the", "         the help.", "", "   -resid PREFIX: Output file name for the residuals. For AFNI format, provide", "         prefix only without view+suffix. Filename for NIfTI format should", "         have .nii attached, while file name for surface data is expected", "         to end with .niml.dset. The sub-brick labeled with the '(Intercept)',", "         if present, should be interpreted as the effect with each factor", "         at the reference level (alphabetically the lowest level) for each", "         factor and with each quantitative covariate at the center value.", "", "   -show_allowed_options: list of allowed options", "", "   -vVarCenters VALUES: Specify centering values for voxel-wise covariates", "         identified under -vVars. Multiple centers are separated by ", "         commas (,) within (single or double) quotes. The order of the", "         values should match that of the quantitative variables in -qVars.", "         Default (absence of option -vVarsCetners) means centering on the", "         average of the variable across ALL subjects regardless their", "         grouping. If within-group centering is desirable, center the", "         variable YOURSELF first before the files are fed into -dataTable.", "", "   -vVars variable_list: Identify voxel-wise covariates with this option.", "         Currently one voxel-wise covariate is allowed only, but this", "         may change if demand occurs...", "         By default mean centering is performed voxel-wise across all", "         subjects. Alternatively centering can be specified through a", "         global value under -vVarsCenters. If th"], "params": [{"param_range": [1000, 1008], "help_range": [1019, 2330]}, {"param_range": [2335, 2344], "help_range": [2354, 2501]}, {"param_range": [2506, 2511], "help_range": [2513, 2530]}, {"param_range": [2535, 2540], "help_range": [2548, 2698]}, {"param_range": [2703, 2710], "help_range": [2712, 2861]}, {"param_range": [2866, 2871], "help_range": [2878, 2948]}, {"param_range": [2953, 2959], "help_range": [2969, 3492]}, {"param_range": [3497, 3505], "help_range": [3514, 3664]}, {"param_range": [3669, 3677], "help_range": [3686, 3832]}, {"param_range": [3837, 3844], "help_range": [3853, 4354]}, {"param_range": [4359, 4371], "help_range": [4380, 5014]}, {"param_range": [5019, 5025], "help_range": [5041, 5771]}, {"param_range": [5776, 5783], "help_range": [5793, 6761]}, {"param_range": [6766, 6772], "help_range": [6781, 7292]}], "previous": "3dLME_part2.json", "next": "3dLME_part4.json"}