{"helptext": [" brackets", "         [] within quotes) specified with a number or label. Unequal number of", "         subjects across groups is allowed, but situations with missing data", "         for a within-subject factor are better handled with 3dLME.", "", "         3) It is fine to have variables (or columns) in the table that are", "         not modeled in the analysis.", "", "         4) The context of the table can be saved as a separate file, e.g.,", "         called table.txt. Do not forget to include a backslash at the end of", "         each row. In the script specify the data with '-dataTable @table.txt'.", "         This option is useful: (a) when there are many input files so that", "         the program complains with an 'Arg list too long' error; (b) when", "         you want to try different models with the same dataset (see 3) above).", "", "   -dbgArgs: This option will enable R to save the parameters in a", "         file called .3dMVM.dbg.AFNI.args in the current directory", "          so that debugging can be performed.", "", "   -glfCode k CODING: Specify the k-th general linear F-test (GLF) through a", "         weighted combination among factor levels. The symbolic coding has", "         to be within (single or double) quotes. For example, the coding", "         'Condition : 1*A -1*B & 1*A -1*C Emotion : 1:pos' tests the main", "         effect of Condition at the positive Emotion. Similarly the coding", "         'Condition : 1*A -1*B & 1*A -1*C Emotion : 1*pos -1*neg' shows", "         the interaction between the three levels of Condition and the two.", "         levels of Emotion.", "", "         NOTE:", "", "         1) The weights for a variable do not have to add up to 0.", "", "         2) When a quantitative variable is present, other effects are", "         tested at the center value of the covariate unless the covariate", "         value is specified as, for example, 'Group : 1*Old Age : 2', where", "         the Old Group is tested at the Age of 2 above the center.", "", "         3)  The absence of a categorical variable in a coding means the", "         levels of that factor are averaged (or collapsed) for the GLF.", "", "         4) The appearance of a categorical variable has to be followed", "         by the linear combination of its levels.", "", "   -glfLabel k label: Specify the label for the k-th general linear F-test", "         (GLF). A symbolic coding for the GLF is assumed to follow with", "         each -glfLabel.", "", "   -gltCode k CODING: Specify the k-th general linear t-test (GLT) through a", "         weighted combination among factor levels. The symbolic coding has", "         to be within (single or double) quotes. For example, the following", "         'Condition : 2*House -3*Face Emotion : 1*positive '", "         requests for a test of comparing 2 times House condition", "         with 3 times Face condition while Emotion is held at positive", "         valence.", "", "         NOTE:", "", "         1) The weights for a variable do not have to add up to 0.", "", "         2) When a quantitative variable is present, other effects are", "         tested at the center value of the covariate unless the covariate", "         value is specified as, for example, 'Group : 1*Old Age : 2', where", "         the Old Group is tested at the Age of 2 above the center.", "", "         3) The effect for a quantitative variable (or slope) can be specified", "         with, for example, 'Group : 1*Old Age : ', or ", "         'Group : 1*Old - 1*Young Age : '", "", "         4) When a quantitative covariate is involved in the model, the", "", "         absence of the covariate in the GLT coding means that the test", "", "         will be performed at the center value of the covarite. However,", "", "         with a value after the colon, the effect would be tested at the", "", "         value of 2 above the center. For example, 'Group : 1*Old Age : 2'", "         shows the effect of the Old Group at the age of 2 years older than", "", "         the center age. On the other hand, 'Group : 1*Old' tests for the", "", "         effect of the Old Group at the center age.", "", "         5) The absence of a categorical variable in a coding means the", "         levels of that factor are averaged (or collapsed) for the GLT.", "", "         6) The appearance of a categorical variable has to be followed", "         by the linear combination of its levels. Only a quantitative", "         is allowed to have a dangling coding as seen in 'Age :'", "", "         7) Some special interaction effects can be tested under -gltCode", "         when the numerical DF is 1. For example, 'Group : 1*Old - 1*Young", "         Condition : 1*House -1*Face Emotion : 1*positive'. Even though", "         this is typically an F-test that can be coded under -glfCode, it", "         can be tested under -gltCode as well. An extra bonus is that the", "         t-test shows the directionality while F-test does not.", "", "   -gltLabel k label: Specify the label for the k-th general linear t-test", "         (GLT). A symbolic coding for the GLT is assumed to follow with", "         each -gltLabel.", "", "   -help: this help message", "", "   -jobs NJOBS: On a multi-processor machine, parallel computing will speed ", "         up the program significantly.", "         Choose 1 for a single-processor computer.", "", "   -mVar variable: With this option, the levels of the within-subject factor", "         will be treated as simultaneous variables in a multivariate model.", "         For example, when the hemodynamic response time course is modeled", "         through multiple basis functions such as TENT, TENTzero, CSPLIN,", "         CSPLINzero, SPMG2/3, etc., the effect estimates at the multiple", "         time points can be treated as simultaneous response variables in", "         a multivariate model. Only one within-subject variable is allowed", "         currently under -mVar. In addition, in the presence of -mVar, no", "         other within-subject factors should be included. If modeling", "         extra within-subject factors with -mVar is desirable, consider", "         flattening such factors; that is, perform multiple analyses", "         at each level or their contrasts of the factor. The output", "         for multivariate testing are labeled with -MV0- in the sub-brick", "         names.", "", "   -mask MASK: Process voxels inside this mask only.", "          Default is no masking.", "", "   -model FORMULA: This option will phase out at some point. So use -bsVars", "         instead. Specify the fixed effects for between-subjects factors ", "         and quantitative variables. When no between-subject factors", "         are present, simply put 1 for FORMULA. The expression FORMULA", "         with more than one variable has to be surrounded within (single or double)", "         quotes. Variable names in the formula should be consistent with", "         the ones used in the header of -dataTable. A+B represents the", "         additive effects of A and B, A:B is the interaction between A", "         and B, and A*B = A+B+A:B. The effects of within-subject", "         factors, if present under -wsVars are automatically assumed", "         to interact with the ones specified here. Subject as a variable", "         should not occur in the model specification here.", "", "   ", "   ", "   -num_glf NUMBER: Specify the number of general linear F-tests (GLFs). A glf", "         involves the union of two or more simple tests. See details in", "         -glfCode.", "", "   -num_glt NUMBER: Specify the number of general linear t-tests (GLTs). A glt", "         is a linear combination of a factor levels. See details in ", "         -gltCode.", "", "   ", "   -prefix PREFIX: Output file name. For AFNI format, provide prefix only,", "         with no view+suffix needed. Filename for NIfTI format should have", "         .nii attached, while file name for surface data is expected", "         to end with .niml.dset. The sub-brick labeled with the '(Intercept)',", "         if present, should be interpreted as the overall average", "         across factor levels at the center value of each covariate.", "", "   -qVars variable_list: Identify quantitative variables (or covariates) with", "         this option. The list with more than one variable has to be", "         separated with comma (,) without any other characters such as", "         spaces and should be surrounded within (single or double) quotes.", "          For example, -qVars \"Age,IQ\"", "         WARNINGS:", "         1) Centering a quantitative variable "], "params": [{"param_range": [1000, 1008], "help_range": [1019, 2188]}, {"param_range": [2193, 2202], "help_range": [2212, 2361]}, {"param_range": [2366, 2374], "help_range": [2385, 4718]}, {"param_range": [4723, 4732], "help_range": [4742, 4891]}, {"param_range": [4896, 4901], "help_range": [4903, 4920]}, {"param_range": [4925, 4930], "help_range": [4938, 5088]}, {"param_range": [5093, 5098], "help_range": [5109, 6056]}, {"param_range": [6061, 6066], "help_range": [6073, 6143]}, {"param_range": [6148, 6154], "help_range": [6164, 6999]}, {"param_range": [7012, 7020], "help_range": [7029, 7178]}], "previous": "3dMVM_part2.json", "next": "3dMVM_part4.json"}