{"helptext": ["ase out at some point. So use -bsVars", "         instead. Specify the fixed effects for between-subjects factors ", "         and quantitative variables. When no between-subject factors", "         are present, simply put 1 for FORMULA. The expression FORMULA", "         with more than one variable has to be surrounded within (single or double)", "         quotes. Variable names in the formula should be consistent with", "         the ones used in the header of -dataTable. A+B represents the", "         additive effects of A and B, A:B is the interaction between A", "         and B, and A*B = A+B+A:B. The effects of within-subject", "         factors, if present under -wsVars are automatically assumed", "         to interact with the ones specified here. Subject as a variable", "         should not occur in the model specification here.", "", "   ", "   ", "   -num_glf NUMBER: Specify the number of general linear F-tests (GLFs). A glf", "         involves the union of two or more simple tests. See details in", "         -glfCode.", "", "   -num_glt NUMBER: Specify the number of general linear t-tests (GLTs). A glt", "         is a linear combination of a factor levels. See details in ", "         -gltCode.", "", "   ", "   -prefix PREFIX: Output file name. For AFNI format, provide prefix only,", "         with no view+suffix needed. Filename for NIfTI format should have", "         .nii attached, while file name for surface data is expected", "         to end with .niml.dset. The sub-brick labeled with the '(Intercept)',", "         if present, should be interpreted as the overall average", "         across factor levels at the center value of each covariate.", "", "   -qVars variable_list: Identify quantitative variables (or covariates) with", "         this option. The list with more than one variable has to be", "         separated with comma (,) without any other characters such as", "         spaces and should be surrounded within (single or double) quotes.", "          For example, -qVars \"Age,IQ\"", "         WARNINGS:", "         1) Centering a quantitative variable through -qVarsCenters is", "         very critical when other fixed effects are of interest.", "         2) Between-subjects covariates are generally acceptable.", "         However EXTREME caution should be taken when the groups", "         differ significantly in the average value of the covariate.", "         3) Within-subject covariates vary across the levels of a", "         within-subject factor, and can be analyzed with 3dLME,", "         but not 3dMVM.", "", "   -qVarCenters VALUES: Specify centering values for quantitative variables", "         identified under -qVars. Multiple centers are separated by ", "         commas (,) within (single or double) quotes. The order of the", "         values should match that of the quantitative variables in -qVars.", "         Default (absence of option -qVarsCetners) means centering on the", "         average of the variable across ALL subjects regardless their", "         grouping. If within-group centering is desirable, center the", "         variable YOURSELF first before the values are fed into -dataTable.", "", "   -robust: Robust regression is performed so that outliers can be", "         reasonably handled through MM-estimation. Currently it", "         only works without involving any within-subject factors.", "         That is, anything that can be done with 3dttest++ could", "         be analyzed through robust regression here (except for", "         one-sample which can be added later one if requested).", "         pairwise comparisons can be performed by providing", "         contrast from each subject as input). Post hoc F-tests", "         through option -glfCode are currently not available with", "         robust regression. This option requires that the user", "         install R package robustbase.", "", "   -show_allowed_options: list of allowed options", "", "   -vVarCenters VALUES: Specify centering values for voxel-wise covariates", "         identified under -vVars. Multiple centers are separated by ", "         commas (,) within (single or double) quotes. The order of the", "         values should match that of the quantitative variables in -qVars.", "         Default (absence of option -vVarsCetners) means centering on the", "         average of the variable across ALL subjects regardless their", "         grouping. If within-group centering is desirable, center the", "         variable YOURSELF first before the files are fed into -dataTable.", "", "   -vVars variable_list: Identify voxel-wise covariates with this option.", "         Currently one voxel-wise covariate is allowed only, but this", "         may change if demand occurs...", "         By default mean centering is performed voxel-wise across all", "         subjects. Alternatively centering can be specified through a", "         global value under -vVarsCenters. If the voxel-wise covariates", "         have already been centered, set the centers at 0 with -vVarsCenters.", "", "   -verb VERB: Speicify ver level.", "", "   -wsE2: If at least one within-subject factor is involved in the model, any", "         omnibus F-test associated with a within-subject factor is assessed", "         with both univariate and within-subject multivariate tests. Use", "         the option only if at least one within-subject factor has more", "         than two levels. By default 3dMVM provides an F-stat through the", "         univariate testing (UVT) method for each effect that involves a", "         within-subject factor. With option -wsE2 UVT is combined with the", "         within-subject multivariate approach, and the merged result remains", "         the same as UVT most of the time (or in most brain regions), but", "         occasionally it may be more powerful.", "", "   -wsMVT: By default 3dMVM provides an F-stat through univariate testing (UVT)", "         for each effect that involves a within-subject factor. If at least", "         one within-subject factor is involved in the model, option -wsMVT", "         provides within-subject multivariate testing for any effect", "         associated with a within-subject variable. The testing strategy is", "         different from the conventional univariate GLM, see more details in", "         Chen et al. (2014), Applications of Multivariate Modeling to", "         Neuroimaging Group Analysis: A Comprehensive Alternative to", "         Univariate General Linear Model. NeuroImage 99, 571-588. If", "         all the within-subject factors have two levels, the multivariate", "         testing would render the same results as the univariate version.", "         So use the option only if at least one within-subject factor has", "         more than two levels. The F-statistics from the multivariate", "         testing are labeled with -wsMVT- in the s"], "params": [{"param_range": [1000, 1008], "help_range": [1017, 1163]}, {"param_range": [1172, 1179], "help_range": [1188, 1601]}, {"param_range": [1606, 1612], "help_range": [1628, 2443]}, {"param_range": [2448, 2460], "help_range": [2469, 3025]}, {"param_range": [3030, 3037], "help_range": [3039, 3708]}, {"param_range": [3713, 3734], "help_range": [3736, 3759]}, {"param_range": [3764, 3776], "help_range": [3785, 4339]}, {"param_range": [4344, 4350], "help_range": [4366, 4814]}, {"param_range": [4819, 4824], "help_range": [4831, 4850]}, {"param_range": [4855, 4860], "help_range": [4862, 5570]}], "previous": "3dMVM_part3.json", "next": "3dMVM_part5.json"}