{"helptext": ["xel-wise across all", "         subjects. Alternatively centering can be specified through a", "         global value under -vVarsCenters. If the voxel-wise covariates", "         have already been centered, set the centers at 0 with -vVarsCenters.", "", "   -verb VERB: Speicify ver level.", "", "   -wsE2: If at least one within-subject factor is involved in the model, any", "         omnibus F-test associated with a within-subject factor is assessed", "         with both univariate and within-subject multivariate tests. Use", "         the option only if at least one within-subject factor has more", "         than two levels. By default 3dMVM provides an F-stat through the", "         univariate testing (UVT) method for each effect that involves a", "         within-subject factor. With option -wsE2 UVT is combined with the", "         within-subject multivariate approach, and the merged result remains", "         the same as UVT most of the time (or in most brain regions), but", "         occasionally it may be more powerful.", "", "   -wsMVT: By default 3dMVM provides an F-stat through univariate testing (UVT)", "         for each effect that involves a within-subject factor. If at least", "         one within-subject factor is involved in the model, option -wsMVT", "         provides within-subject multivariate testing for any effect", "         associated with a within-subject variable. The testing strategy is", "         different from the conventional univariate GLM, see more details in", "         Chen et al. (2014), Applications of Multivariate Modeling to", "         Neuroimaging Group Analysis: A Comprehensive Alternative to", "         Univariate General Linear Model. NeuroImage 99, 571-588. If", "         all the within-subject factors have two levels, the multivariate", "         testing would render the same results as the univariate version.", "         So use the option only if at least one within-subject factor has", "         more than two levels. The F-statistics from the multivariate", "         testing are labeled with -wsMVT- in the sub-brick names. Note that", "         the conventional univariate F-statistics are automatically included", "         in the beginning of the output regardless the presence of this option.", "", "   -wsVars FORMULA: Within-subject factors, if present, have to be listed", "         here; otherwise the program will choke. If no within-subject ", "         exists, don't include this option in the script. Coding for", "         additive effects and interactions is the same as in -bsVars. The", "         FORMULA with more than one variable has to be surrounded ", "         within (single or double) quotes. Note that the within-subject", "         variables are assumed to interact with those between-subjects", "         variables specified under -bsVars. The hemodynamic response", "         time course are better modeled as simultaneous outcomes through", "         option -mVar, and not as the levels of a within-subject factor.", "         The varialbes under -wsVars and -mVar are exclusive from each", "         other."], "params": [{"param_range": [1000, 1006], "help_range": [1008, 2182]}, {"param_range": [2187, 2194], "help_range": [2204, 2983]}], "previous": "3dMVM_part4.json"}